OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1559.h
#define _AD2CON3_AD2DSEN        0x01
#define _AD2CON3_ADDSEN         0x01
#define _AD2CON3_AD2IPEN        0x02
#define _AD2CON3_ADIPEN         0x02
#define _AD2CON3_AD2IPPOL       0x40
#define _AD2CON3_ADIPPOL        0x40
#define _AD2CON3_AD2EPPOL       0x80
#define _AD2CON3_ADEPPOL        0x80

//==============================================================================


//==============================================================================
//        AAD2PRE Bits

extern __at(0x0796) __sfr AAD2PRE;

typedef union
  {
  struct
    {
    unsigned ADPRE0             : 1;
    unsigned ADPRE1             : 1;
    unsigned ADPRE2             : 1;
    unsigned ADPRE3             : 1;
    unsigned ADPRE4             : 1;
    unsigned ADPRE5             : 1;
    unsigned ADPRE6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADPRE              : 7;
    unsigned                    : 1;
    };
  } __AAD2PREbits_t;

extern __at(0x0796) volatile __AAD2PREbits_t AAD2PREbits;

#define _AAD2PRE_ADPRE0         0x01
#define _AAD2PRE_ADPRE1         0x02
#define _AAD2PRE_ADPRE2         0x04
#define _AAD2PRE_ADPRE3         0x08
#define _AAD2PRE_ADPRE4         0x10
#define _AAD2PRE_ADPRE5         0x20
#define _AAD2PRE_ADPRE6         0x40

//==============================================================================


//==============================================================================
//        AD2PRE Bits

extern __at(0x0796) __sfr AD2PRE;

typedef union
  {
  struct
    {
    unsigned ADPRE0             : 1;
    unsigned ADPRE1             : 1;
    unsigned ADPRE2             : 1;
    unsigned ADPRE3             : 1;
    unsigned ADPRE4             : 1;
    unsigned ADPRE5             : 1;
    unsigned ADPRE6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADPRE              : 7;
    unsigned                    : 1;
    };
  } __AD2PREbits_t;

extern __at(0x0796) volatile __AD2PREbits_t AD2PREbits;

#define _AD2PRE_ADPRE0          0x01
#define _AD2PRE_ADPRE1          0x02
#define _AD2PRE_ADPRE2          0x04
#define _AD2PRE_ADPRE3          0x08
#define _AD2PRE_ADPRE4          0x10
#define _AD2PRE_ADPRE5          0x20
#define _AD2PRE_ADPRE6          0x40

//==============================================================================


//==============================================================================
//        AD2PRECON Bits

extern __at(0x0796) __sfr AD2PRECON;

typedef union
  {
  struct
    {
    unsigned ADPRE0             : 1;
    unsigned ADPRE1             : 1;
    unsigned ADPRE2             : 1;
    unsigned ADPRE3             : 1;
    unsigned ADPRE4             : 1;
    unsigned ADPRE5             : 1;
    unsigned ADPRE6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADPRE              : 7;
    unsigned                    : 1;
    };
  } __AD2PRECONbits_t;

extern __at(0x0796) volatile __AD2PRECONbits_t AD2PRECONbits;

#define _AD2PRECON_ADPRE0       0x01
#define _AD2PRECON_ADPRE1       0x02
#define _AD2PRECON_ADPRE2       0x04
#define _AD2PRECON_ADPRE3       0x08
#define _AD2PRECON_ADPRE4       0x10
#define _AD2PRECON_ADPRE5       0x20
#define _AD2PRECON_ADPRE6       0x40

//==============================================================================


//==============================================================================
//        AAD2ACQ Bits

extern __at(0x0797) __sfr AAD2ACQ;

typedef union
  {
  struct
    {
    unsigned ADACQ0             : 1;
    unsigned ADACQ1             : 1;
    unsigned ADACQ2             : 1;
    unsigned ADACQ3             : 1;
    unsigned ADACQ4             : 1;
    unsigned ADACQ5             : 1;
    unsigned ADACQ6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADACQ              : 7;
    unsigned                    : 1;
    };
  } __AAD2ACQbits_t;

extern __at(0x0797) volatile __AAD2ACQbits_t AAD2ACQbits;

#define _AAD2ACQ_ADACQ0         0x01
#define _AAD2ACQ_ADACQ1         0x02
#define _AAD2ACQ_ADACQ2         0x04
#define _AAD2ACQ_ADACQ3         0x08
#define _AAD2ACQ_ADACQ4         0x10
#define _AAD2ACQ_ADACQ5         0x20
#define _AAD2ACQ_ADACQ6         0x40

//==============================================================================


//==============================================================================
//        AD2ACQ Bits

extern __at(0x0797) __sfr AD2ACQ;

typedef union
  {
  struct
    {
    unsigned ADACQ0             : 1;
    unsigned ADACQ1             : 1;
    unsigned ADACQ2             : 1;
    unsigned ADACQ3             : 1;
    unsigned ADACQ4             : 1;
    unsigned ADACQ5             : 1;
    unsigned ADACQ6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADACQ              : 7;
    unsigned                    : 1;
    };
  } __AD2ACQbits_t;

extern __at(0x0797) volatile __AD2ACQbits_t AD2ACQbits;

#define _AD2ACQ_ADACQ0          0x01
#define _AD2ACQ_ADACQ1          0x02
#define _AD2ACQ_ADACQ2          0x04
#define _AD2ACQ_ADACQ3          0x08
#define _AD2ACQ_ADACQ4          0x10
#define _AD2ACQ_ADACQ5          0x20
#define _AD2ACQ_ADACQ6          0x40

//==============================================================================


//==============================================================================
//        AD2ACQCON Bits

extern __at(0x0797) __sfr AD2ACQCON;

typedef union
  {
  struct
    {
    unsigned ADACQ0             : 1;
    unsigned ADACQ1             : 1;
    unsigned ADACQ2             : 1;
    unsigned ADACQ3             : 1;
    unsigned ADACQ4             : 1;
    unsigned ADACQ5             : 1;
    unsigned ADACQ6             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADACQ              : 7;
    unsigned                    : 1;
    };
  } __AD2ACQCONbits_t;

extern __at(0x0797) volatile __AD2ACQCONbits_t AD2ACQCONbits;

#define _AD2ACQCON_ADACQ0       0x01
#define _AD2ACQCON_ADACQ1       0x02
#define _AD2ACQCON_ADACQ2       0x04
#define _AD2ACQCON_ADACQ3       0x08
#define _AD2ACQCON_ADACQ4       0x10
#define _AD2ACQCON_ADACQ5       0x20
#define _AD2ACQCON_ADACQ6       0x40

//==============================================================================


//==============================================================================
//        AAD2GRD Bits

